In [1]:
from pandas import Series, DataFrame

In [2]:
import numpy as np

In [3]:
df = DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],
              'key2' : ['one', 'two', 'one', 'two', 'one'],
              'data1' : np.random.randn(5),
              'data2' : np.random.randn(5)})

In [4]:
df

  key1 key2     data1     data2
0    a  one -0.227350 -0.987149
1    a  two -0.375902 -0.411348
2    b  one  0.784761 -0.683739
3    b  two  0.881147 -0.103909
4    a  one  0.848894 -0.508231

In [5]:
grouped = df['data1'].groupby(df['key1'])

In [6]:
grouped.mean()

key1
a    0.081881
b    0.832954
Name: data1, dtype: float64

In [7]:
means = df['data1'].groupby([df['key1'], df['key2']]).mean()

In [8]:
means

key1  key2
a     one     0.310772
      two    -0.375902
b     one     0.784761
      two     0.881147
Name: data1, dtype: float64

In [9]:
means.unstack()

key2       one       two
key1
a     0.310772 -0.375902
b     0.784761  0.881147

In [10]:
states = np.array(['Ohio', 'California', 'California', 'Ohio', 'Ohio'])

In [11]:
years = np.array([2005, 2005, 2006, 2005, 2006])

In [12]:
df['data1'].groupby([states, years]).mean() # 相当于重新索引了原始数据表

California  2005   -0.375902
            2006    0.784761
Ohio        2005    0.326899
            2006    0.848894
Name: data1, dtype: float64

In [13]:
df.groupby('key1').mean() # 自动过滤了非数值列 key2

         data1     data2
key1
a     0.081881 -0.635576
b     0.832954 -0.393824

In [14]:
df.groupby(['key1', 'key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

In [15]:
for name, group in df.groupby('key1'):
    print(name)
    print(group)

a
  key1 key2     data1     data2
0    a  one -0.227350 -0.987149
1    a  two -0.375902 -0.411348
4    a  one  0.848894 -0.508231
b
  key1 key2     data1     data2
2    b  one  0.784761 -0.683739
3    b  two  0.881147 -0.103909

In [16]:
for name, group in df.groupby(['key1','key2']):
    print(name)
    print(group)

('a', 'one')
  key1 key2     data1     data2
0    a  one -0.227350 -0.987149
4    a  one  0.848894 -0.508231
('a', 'two')
  key1 key2     data1     data2
1    a  two -0.375902 -0.411348
('b', 'one')
  key1 key2     data1     data2
2    b  one  0.784761 -0.683739
('b', 'two')
  key1 key2     data1     data2
3    b  two  0.881147 -0.103909

In [17]:
pieces = dict(list(df.groupby('key1')))

In [18]:
pieces['b']

  key1 key2     data1     data2
2    b  one  0.784761 -0.683739
3    b  two  0.881147 -0.103909

In [19]:
df.dtypes

key1      object
key2      object
data1    float64
data2    float64
dtype: object

In [20]:
grouped = df.groupby(df.dtypes, axis=1) # 对原始数据表的列进行分组，按数据类型

In [21]:
dict(list(grouped))

{dtype('float64'):       data1     data2
 0 -0.227350 -0.987149
 1 -0.375902 -0.411348
 2  0.784761 -0.683739
 3  0.881147 -0.103909
 4  0.848894 -0.508231, dtype('O'):   key1 key2
 0    a  one
 1    a  two
 2    b  one
 3    b  two
 4    a  one}

In [22]:
df.groupby('key1')['data1'] # 和 df['data1'].groupby(df['key1']) 等效，但好像没少打几个字，后面的 df[] 也可以不用写的吧

In [23]:
s_grouped = df.groupby(['key1', 'key2'])['data1']

In [24]:
s_grouped.mean()

key1  key2
a     one     0.310772
      two    -0.375902
b     one     0.784761
      two     0.881147
Name: data1, dtype: float64

In [25]:
people = DataFrame(np.random.randn(5, 5),
                  columns=['a', 'b', 'c', 'd', 'e'],
                  index=['Joe', 'Steve', 'Wes', 'Jim', 'Travis'])

In [26]:
people

               a         b         c         d         e
Joe    -1.505023 -0.292882  0.541380  0.072008 -1.649238
Steve   0.147567  1.139731 -1.867728 -1.846440  0.142515
Wes     0.953762  0.815827  0.201258 -0.804586 -0.683407
Jim    -0.255377 -1.567748  0.055919 -0.166752 -1.213592
Travis -0.335705 -0.262642 -1.476255 -1.354069 -0.817037

In [27]:
people.loc[2:3, ['b', 'c']] = np.nan

In [28]:
people

               a         b         c         d         e
Joe    -1.505023 -0.292882  0.541380  0.072008 -1.649238
Steve   0.147567  1.139731 -1.867728 -1.846440  0.142515
Wes     0.953762       NaN       NaN -0.804586 -0.683407
Jim    -0.255377 -1.567748  0.055919 -0.166752 -1.213592
Travis -0.335705 -0.262642 -1.476255 -1.354069 -0.817037

In [29]:
mapping = {'a':'red', 'b':'red', 'c':'blue',
          'd':'blue', 'e':'red', 'f':'orange'}

In [30]:
by_column = people.groupby(mapping, axis=1) # 用字典进行分组

In [31]:
by_column.sum()

            blue       red
Joe     0.613388 -3.447144
Steve  -3.714168  1.429813
Wes    -0.804586  0.270355
Jim    -0.110833 -3.036717
Travis -2.830325 -1.415385

In [32]:
map_series = Series(mapping)

In [33]:
map_series

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [34]:
people.groupby(map_series, axis=1).count() # 用 Series 进行分组

        blue  red
Joe        2    3
Steve      2    3
Wes        1    2
Jim        2    3
Travis     2    3

In [35]:
people.groupby(len).count() # 用函数进行分组

   a  b  c  d  e
3  3  2  2  3  3
5  1  1  1  1  1
6  1  1  1  1  1

In [36]:
key_list = ['one', 'one', 'one', 'two', 'two']

In [37]:
people.groupby([len, key_list]).min() # 想怎么搭配就怎么搭配。。。

              a         b         c         d         e
3 one -1.505023 -0.292882  0.541380 -0.804586 -1.649238
  two -0.255377 -1.567748  0.055919 -0.166752 -1.213592
5 one  0.147567  1.139731 -1.867728 -1.846440  0.142515
6 two -0.335705 -0.262642 -1.476255 -1.354069 -0.817037

In [38]:
import pandas as pd

In [39]:
columns = pd.MultiIndex.from_arrays([['US', 'US', 'US', 'JP', 'JP'],
                                    [1, 3, 5, 1, 3]], names=['cty', 'tenor'])

In [40]:
columns

MultiIndex([('US', 1),
            ('US', 3),
            ('US', 5),
            ('JP', 1),
            ('JP', 3)],
           names=['cty', 'tenor'])

In [41]:
hier_df = DataFrame(np.random.randn(4, 5), columns=columns)

In [42]:
hier_df

cty          US                            JP
tenor         1         3         5         1         3
0     -0.089036  0.720603 -0.047779  2.282403 -0.216311
1     -0.428294  1.513373  0.061307  1.042642  0.625077
2      0.786124 -0.236249 -0.429072 -0.166419 -0.459304
3      0.147241 -0.951121  0.116811 -1.094258 -1.024582

In [43]:
hier_df.groupby(level='cty', axis=1).count()

cty  JP  US
0     2   3
1     2   3
2     2   3
3     2   3

In [44]:
df

  key1 key2     data1     data2
0    a  one -0.227350 -0.987149
1    a  two -0.375902 -0.411348
2    b  one  0.784761 -0.683739
3    b  two  0.881147 -0.103909
4    a  one  0.848894 -0.508231

In [45]:
grouped = df.groupby('key1')

In [46]:
grouped['data1'].quantile(0.9) # 样本分位数，如果输入没有相应的值，会线性插值

key1
a    0.633645
b    0.871508
Name: data1, dtype: float64

In [47]:
def peak_to_peak(arr):
    return arr.max() - arr.min()

In [48]:
grouped.agg(peak_to_peak) # 使用自定义聚合函数

         data1     data2
key1
a     1.224796  0.575801
b     0.096385  0.579830

In [49]:
grouped.describe()

     data1                                                              \
     count      mean       std       min       25%       50%       75%
key1
a      3.0  0.081881  0.668393 -0.375902 -0.301626 -0.227350  0.310772
b      2.0  0.832954  0.068155  0.784761  0.808858  0.832954  0.857050

               data2                                                    \
           max count      mean       std       min       25%       50%
key1
a     0.848894   3.0 -0.635576  0.308300 -0.987149 -0.747690 -0.508231
b     0.881147   2.0 -0.393824  0.410002 -0.683739 -0.538781 -0.393824


           75%       max
key1
a    -0.459790 -0.411348
b    -0.248866 -0.103909

In [50]:
tips = pd.read_csv('data/tips.csv')

In [51]:
tips.head(5)

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [52]:
tips['tip_pct'] = tips['tip'] / tips['total_bill']

In [53]:
tips[:5]

   total_bill   tip     sex smoker  day    time  size   tip_pct
0       16.99  1.01  Female     No  Sun  Dinner     2  0.059447
1       10.34  1.66    Male     No  Sun  Dinner     3  0.160542
2       21.01  3.50    Male     No  Sun  Dinner     3  0.166587
3       23.68  3.31    Male     No  Sun  Dinner     2  0.139780
4       24.59  3.61  Female     No  Sun  Dinner     4  0.146808

In [54]:
grouped = tips.groupby(['sex', 'smoker'])

In [55]:
grouped_pct = grouped['tip_pct']

In [56]:
grouped_pct.agg('mean') # 和直接调用 mean() 的效果一样

sex     smoker
Female  No        0.156921
        Yes       0.182150
Male    No        0.160669
        Yes       0.152771
Name: tip_pct, dtype: float64

In [57]:
grouped_pct.agg(['mean', 'std', peak_to_peak]) # 可以传入一组函数名

                   mean       std  peak_to_peak
sex    smoker
Female No      0.156921  0.036421      0.195876
       Yes     0.182150  0.071595      0.360233
Male   No      0.160669  0.041849      0.220186
       Yes     0.152771  0.090588      0.674707

In [58]:
grouped_pct.agg([('foo', 'mean'), ('bar', np.std)]) # 也可以用 tuple 对列名做映射

                    foo       bar
sex    smoker
Female No      0.156921  0.036421
       Yes     0.182150  0.071595
Male   No      0.160669  0.041849
       Yes     0.152771  0.090588

In [59]:
functions = ['count', 'mean', 'max']

In [60]:
result = grouped['tip_pct', 'total_bill'].agg(functions) # 对多个列进行指定的（多个）统计

In [61]:
result

              tip_pct                     total_bill
                count      mean       max      count       mean    max
sex    smoker
Female No          54  0.156921  0.252672         54  18.105185  35.83
       Yes         33  0.182150  0.416667         33  17.977879  44.30
Male   No          97  0.160669  0.291990         97  19.791237  48.33
       Yes         60  0.152771  0.710345         60  22.284500  50.81

In [62]:
result['tip_pct']

               count      mean       max
sex    smoker
Female No         54  0.156921  0.252672
       Yes        33  0.182150  0.416667
Male   No         97  0.160669  0.291990
       Yes        60  0.152771  0.710345

In [63]:
ftuples = [('平均', 'mean'), ('方差', np.var)] # 还是可以自定义名称

In [64]:
grouped['tip_pct', 'total_bill'].agg(ftuples)

                tip_pct           total_bill
                     平均        方差         平均         方差
sex    smoker
Female No      0.156921  0.001327  18.105185  53.092422
       Yes     0.182150  0.005126  17.977879  84.451517
Male   No      0.160669  0.001751  19.791237  76.152961
       Yes     0.152771  0.008206  22.284500  98.244673

In [65]:
grouped.agg({'tip':np.max, 'size':'sum'}) # 用字典对不同列应用不同的函数

                tip  size
sex    smoker
Female No       5.2   140
       Yes      6.5    74
Male   No       9.0   263
       Yes     10.0   150

In [66]:
grouped.agg({'tip_pct':['min', 'max'], 'size':'sum'})

                tip_pct           size
                    min       max  sum
sex    smoker
Female No      0.056797  0.252672  140
       Yes     0.056433  0.416667   74
Male   No      0.071804  0.291990  263
       Yes     0.035638  0.710345  150

In [67]:
key = ['one', 'two', 'one', 'two', 'one']

In [68]:
people.groupby(key).mean()

            a         b         c         d         e
one -0.295656 -0.277762 -0.467437 -0.695549 -1.049894
two -0.053905 -0.214009 -0.905904 -1.006596 -0.535539

In [69]:
people.groupby(key).transform(np.mean) # 对比上一条语句，将分组的处理结果再传播回原始数据上

               a         b         c         d         e
Joe    -0.295656 -0.277762 -0.467437 -0.695549 -1.049894
Steve  -0.053905 -0.214009 -0.905904 -1.006596 -0.535539
Wes    -0.295656 -0.277762 -0.467437 -0.695549 -1.049894
Jim    -0.053905 -0.214009 -0.905904 -1.006596 -0.535539
Travis -0.295656 -0.277762 -0.467437 -0.695549 -1.049894

In [70]:
def demean(arr):
    return arr - arr.mean()

In [71]:
demeaned = people.groupby(key).transform(demean) # 这个就有点意思了

In [72]:
demeaned

               a        b         c         d         e
Joe    -1.209368 -0.01512  1.008818  0.767557 -0.599344
Steve   0.201472  1.35374 -0.961823 -0.839844  0.678054
Wes     1.249417      NaN       NaN -0.109037  0.366487
Jim    -0.201472 -1.35374  0.961823  0.839844 -0.678054
Travis -0.040050  0.01512 -1.008818 -0.658520  0.232857

In [73]:
demeaned.groupby(key).mean() # 确认上一条语句的结果，可以算是零了

                a    b             c             d             e
one -5.551115e-17  0.0  0.000000e+00  3.700743e-17 -7.401487e-17
two  0.000000e+00  0.0  5.551115e-17  0.000000e+00 -5.551115e-17

In [74]:
def top(df, n=5, column='tip_pct'):
    return df.sort_values(by=column)[-n:]

In [75]:
top(tips, n=3)

     total_bill   tip     sex smoker  day    time  size   tip_pct
67         3.07  1.00  Female    Yes  Sat  Dinner     1  0.325733
178        9.60  4.00  Female    Yes  Sun  Dinner     2  0.416667
172        7.25  5.15    Male    Yes  Sun  Dinner     2  0.710345

In [76]:
tips.groupby('smoker').apply(top) # 先对分组调用 top，再合并结果

            total_bill   tip     sex smoker   day    time  size   tip_pct
smoker
No     88        24.71  5.85    Male     No  Thur   Lunch     2  0.236746
       185       20.69  5.00    Male     No   Sun  Dinner     5  0.241663
       51        10.29  2.60  Female     No   Sun  Dinner     2  0.252672
       149        7.51  2.00    Male     No  Thur   Lunch     2  0.266312
       232       11.61  3.39    Male     No   Sat  Dinner     2  0.291990
Yes    109       14.31  4.00  Female    Yes   Sat  Dinner     2  0.279525
       183       23.17  6.50    Male    Yes   Sun  Dinner     4  0.280535
       67         3.07  1.00  Female    Yes   Sat  Dinner     1  0.325733
       178        9.60  4.00  Female    Yes   Sun  Dinner     2  0.416667
       172        7.25  5.15    Male    Yes   Sun  Dinner     2  0.710345

In [77]:
tips.groupby(['smoker', 'day']).apply(top, n=1, column='total_bill') # 可以指定参数的

                 total_bill    tip     sex smoker   day    time  size  \
smoker day
No     Fri  94        22.75   3.25  Female     No   Fri  Dinner     2
       Sat  212       48.33   9.00    Male     No   Sat  Dinner     4
       Sun  156       48.17   5.00    Male     No   Sun  Dinner     6
       Thur 142       41.19   5.00    Male     No  Thur   Lunch     5
Yes    Fri  95        40.17   4.73    Male    Yes   Fri  Dinner     4
       Sat  170       50.81  10.00    Male    Yes   Sat  Dinner     3
       Sun  182       45.35   3.50    Male    Yes   Sun  Dinner     3
       Thur 197       43.11   5.00  Female    Yes  Thur   Lunch     4

                  tip_pct
smoker day
No     Fri  94   0.142857
       Sat  212  0.186220
       Sun  156  0.103799
       Thur 142  0.121389
Yes    Fri  95   0.117750
       Sat  170  0.196812
       Sun  182  0.077178
       Thur 197  0.115982

In [78]:
tips.groupby('smoker', group_keys=False).apply(top)

     total_bill   tip     sex smoker   day    time  size   tip_pct
88        24.71  5.85    Male     No  Thur   Lunch     2  0.236746
185       20.69  5.00    Male     No   Sun  Dinner     5  0.241663
51        10.29  2.60  Female     No   Sun  Dinner     2  0.252672
149        7.51  2.00    Male     No  Thur   Lunch     2  0.266312
232       11.61  3.39    Male     No   Sat  Dinner     2  0.291990
109       14.31  4.00  Female    Yes   Sat  Dinner     2  0.279525
183       23.17  6.50    Male    Yes   Sun  Dinner     4  0.280535
67         3.07  1.00  Female    Yes   Sat  Dinner     1  0.325733
178        9.60  4.00  Female    Yes   Sun  Dinner     2  0.416667
172        7.25  5.15    Male    Yes   Sun  Dinner     2  0.710345

In [79]:
frame = DataFrame({'data1': np.random.randn(1000),
                  'data2': np.random.randn(1000)})

In [80]:
factor = pd.cut(frame.data1, 4) # 第七章：按最大最小数值的范围切成四份，然后分门别类

In [81]:
factor[:10]

0     (-1.584, 0.131]
1     (-1.584, 0.131]
2    (-3.306, -1.584]
3      (0.131, 1.847]
4      (0.131, 1.847]
5     (-1.584, 0.131]
6     (-1.584, 0.131]
7     (-1.584, 0.131]
8     (-1.584, 0.131]
9      (0.131, 1.847]
Name: data1, dtype: category
Categories (4, interval[float64]): [(-3.306, -1.584] < (-1.584, 0.131] < (0.131, 1.847] < (1.847, 3.562]]

In [82]:
def get_stats(group):
    return {'min': group.min(), 'max': group.max(),
           'count': group.count(), 'mean': group.mean()}

In [83]:
grouped = frame.data2.groupby(factor)

In [84]:
grouped.apply(get_stats).unstack()

                       min       max  count      mean
data1
(-3.306, -1.584] -2.560904  1.978600   69.0 -0.074040
(-1.584, 0.131]  -3.477797  3.011406  520.0 -0.044752
(0.131, 1.847]   -3.157301  3.077047  375.0 -0.002455
(1.847, 3.562]   -1.646724  1.670380   36.0 -0.004068

In [85]:
s = Series(np.random.randn(6))

In [86]:
s[::2] = np.nan

In [87]:
s.fillna(s.mean()) # 用平均值填充 NA 值

0    0.461636
1   -0.184315
2    0.461636
3    1.335723
4    0.461636
5    0.233499
dtype: float64

In [88]:
states = ['Ohio', 'New York', 'Vermont', 'Florida',
         'Orgeon', 'Nevada', 'California', 'Idaho']

In [89]:
group_key = ['East'] * 4 + ['West'] * 4

In [90]:
data = Series(np.random.randn(8), index=states)

In [91]:
data[['Vermont', 'Nevada', 'Idaho']] = np.nan

In [92]:
data

Ohio         -0.329415
New York      0.908406
Vermont            NaN
Florida       1.277031
Orgeon       -0.644774
Nevada             NaN
California   -0.941785
Idaho              NaN
dtype: float64

In [93]:
data.groupby(group_key).mean()

East    0.618674
West   -0.793280
dtype: float64

In [94]:
fill_mean = lambda g: g.fillna(g.mean())

In [95]:
data.groupby(group_key).apply(fill_mean) # 对不同的分组填充不同的数值

Ohio         -0.329415
New York      0.908406
Vermont       0.618674
Florida       1.277031
Orgeon       -0.644774
Nevada       -0.793280
California   -0.941785
Idaho        -0.793280
dtype: float64

In [96]:
fill_values = {'East':0.5, 'West':-1}

In [97]:
fill_func = lambda g: g.fillna(fill_values[g.name]) # 参照前面遍历 groupby 结果，name 应该是分组名称？

In [98]:
data.groupby(group_key).apply(fill_func)

Ohio         -0.329415
New York      0.908406
Vermont       0.500000
Florida       1.277031
Orgeon       -0.644774
Nevada       -1.000000
California   -0.941785
Idaho        -1.000000
dtype: float64

In [99]:
suits = ['H', 'S', 'C', 'D']
card_val = (list(range(1, 11)) + [10] * 3) * 4
base_names = ['A'] + list(range(2,11)) + ['J', 'Q', 'K']
cards = []
for suit in suits:
    cards.extend(str(num) + suit for num in base_names)
deck = Series(card_val, index=cards)

In [100]:
deck[:14]

AH      1
2H      2
3H      3
4H      4
5H      5
6H      6
7H      7
8H      8
9H      9
10H    10
JH     10
QH     10
KH     10
AS      1
dtype: int64

In [101]:
def draw(deck, n=5):
    return deck.take(np.random.permutation(len(deck))[:n])

In [102]:
draw(deck, 3)

QD    10
3S     3
3D     3
dtype: int64

In [103]:
get_suit = lambda card: card[-1]

In [104]:
deck.groupby(get_suit).apply(draw, n=2) # 每个花色来两张！

C  9C     9
   KC    10
D  9D     9
   7D     7
H  4H     4
   3H     3
S  5S     5
   KS    10
dtype: int64

In [105]:
df = DataFrame({'category': ['a', 'a', 'a', 'a', 'b', 'b', 'b', 'b'],
               'data': np.random.randn(8),
               'weights': np.random.rand(8)})

In [106]:
df

  category      data   weights
0        a -1.678094  0.906004
1        a -0.211022  0.096852
2        a -0.784573  0.863694
3        a  0.410910  0.997849
4        b -0.846249  0.940087
5        b -0.270278  0.446994
6        b -0.469932  0.191219
7        b -2.114938  0.635809

In [107]:
grouped = df.groupby('category')

In [108]:
get_wavg = lambda g: np.average(g['data'], weights=g['weights']) # 加权平均

In [109]:
grouped.apply(get_wavg)

category
a   -0.631337
b   -1.061789
dtype: float64

In [110]:
close_px = pd.read_csv('data/stock_px.csv', parse_dates=True, index_col=0)

In [111]:
close_px[-3:]

              AAPL   MSFT    XOM      SPX
2011-10-12  402.19  26.96  77.16  1207.25
2011-10-13  408.43  27.18  76.37  1203.66
2011-10-14  422.00  27.27  78.11  1224.58

In [112]:
rets = close_px.pct_change().dropna()

In [113]:
spx_corr = lambda x: x.corrwith(x['SPX'])

In [114]:
by_year = rets.groupby(lambda x: x.year)

In [115]:
by_year.apply(spx_corr) # 这个叫做日收益率与 SPX 之间的年度相关系数

          AAPL      MSFT       XOM  SPX
2003  0.541124  0.745174  0.661265  1.0
2004  0.374283  0.588531  0.557742  1.0
2005  0.467540  0.562374  0.631010  1.0
2006  0.428267  0.406126  0.518514  1.0
2007  0.508118  0.658770  0.786264  1.0
2008  0.681434  0.804626  0.828303  1.0
2009  0.707103  0.654902  0.797921  1.0
2010  0.710105  0.730118  0.839057  1.0
2011  0.691931  0.800996  0.859975  1.0

In [116]:
import statsmodels.api as sm

In [117]:
def regress(data, yvar, xvars):
    Y = data[yvar]
    X = data[xvars]
    X['intercept'] = 1
    result = sm.OLS(Y, X).fit()
    return result.params

In [118]:
by_year.apply(regress, 'AAPL', ['SPX']) # 按年计算 AAPL 对 SPX 收益率的线性回归。。。啥意思？

           SPX  intercept
2003  1.195406   0.000710
2004  1.363463   0.004201
2005  1.766415   0.003246
2006  1.645496   0.000080
2007  1.198761   0.003438
2008  0.968016  -0.001110
2009  0.879103   0.002954
2010  1.052608   0.001261
2011  0.806605   0.001514

In [119]:
tips.pivot_table(index=['sex', 'smoker']) # 类似前面的 groupby 加 mean()

                   size       tip   tip_pct  total_bill
sex    smoker
Female No      2.592593  2.773519  0.156921   18.105185
       Yes     2.242424  2.931515  0.182150   17.977879
Male   No      2.711340  3.113402  0.160669   19.791237
       Yes     2.500000  3.051167  0.152771   22.284500

In [120]:
tips.pivot_table(['tip_pct', 'size'], index=['sex', 'day'],
                columns='smoker')

                 size             tip_pct
smoker             No       Yes        No       Yes
sex    day
Female Fri   2.500000  2.000000  0.165296  0.209129
       Sat   2.307692  2.200000  0.147993  0.163817
       Sun   3.071429  2.500000  0.165710  0.237075
       Thur  2.480000  2.428571  0.155971  0.163073
Male   Fri   2.000000  2.125000  0.138005  0.144730
       Sat   2.656250  2.629630  0.162132  0.139067
       Sun   2.883721  2.600000  0.158291  0.173964
       Thur  2.500000  2.300000  0.165706  0.164417

In [121]:
tips.pivot_table(['tip_pct', 'size'], index=['sex', 'day'],
                columns='smoker', margins=True) # All 为不考虑相应分组的平均值

                 size                       tip_pct
smoker             No       Yes       All        No       Yes       All
sex    day
Female Fri   2.500000  2.000000  2.111111  0.165296  0.209129  0.199388
       Sat   2.307692  2.200000  2.250000  0.147993  0.163817  0.156470
       Sun   3.071429  2.500000  2.944444  0.165710  0.237075  0.181569
       Thur  2.480000  2.428571  2.468750  0.155971  0.163073  0.157525
Male   Fri   2.000000  2.125000  2.100000  0.138005  0.144730  0.143385
       Sat   2.656250  2.629630  2.644068  0.162132  0.139067  0.151577
       Sun   2.883721  2.600000  2.810345  0.158291  0.173964  0.162344
       Thur  2.500000  2.300000  2.433333  0.165706  0.164417  0.165276
All          2.668874  2.408602  2.569672  0.159328  0.163196  0.160803

In [122]:
tips.pivot_table('tip_pct', index=['sex', 'smoker'], columns='day',
                aggfunc=len, margins=True)

day             Fri   Sat   Sun  Thur    All
sex    smoker
Female No       2.0  13.0  14.0  25.0   54.0
       Yes      7.0  15.0   4.0   7.0   33.0
Male   No       2.0  32.0  43.0  20.0   97.0
       Yes      8.0  27.0  15.0  10.0   60.0
All            19.0  87.0  76.0  62.0  244.0

In [123]:
tips.pivot_table('size', index=['time', 'sex', 'smoker'],
                columns='day', aggfunc='sum', fill_value=0)

day                   Fri  Sat  Sun  Thur
time   sex    smoker
Dinner Female No        2   30   43     2
              Yes       8   33   10     0
       Male   No        4   85  124     0
              Yes      12   71   39     0
Lunch  Female No        3    0    0    60
              Yes       6    0    0    17
       Male   No        0    0    0    50
              Yes       5    0    0    23

In [124]:
pd.crosstab([tips.time, tips.day], tips.smoker, margins=True) # 和 pivot_table 类似的效果，但似乎方便一些

smoker        No  Yes  All
time   day
Dinner Fri     3    9   12
       Sat    45   42   87
       Sun    57   19   76
       Thur    1    0    1
Lunch  Fri     1    6    7
       Thur   44   17   61
All          151   93  244